app/views/messages/_message.html.erb

INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["room_id", 1], ["content", "hhh"], ["created_at", "2024-07-05 09:46:01.638353"], ["updated_at", "2024-07-05 09:46:01.638353"]]
---
    <% end %>
    <p class="text-black small mb-0"><i class="far fa-clock"></i> <%=message.created_at.strftime("%H:%M") %></p>