app/controllers/rooms_controller.rb

  def create
    @room = Room.create(name: params['room']['name'])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ddd"], ["is_private", false], ["created_at", "2024-07-05 09:37:41.961790"], ["updated_at", "2024-07-05 09:37:41.961790"]]

  def show
    @single_room = Room.find(params[:id])
    current_user.update_without_password(room_id: @single_room.id)

    @rooms = Room.public_rooms
    @users = User.all_except(current_user)
    @room = Room.new
    @message = Message.new

    @messages = @single_room.messages.order(created_at: :asc)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "room_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-07-05 09:37:42.839069"], ["room_id", 1], ["id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" ASC  [["room_id", 1]]