app/models/message.rb

SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 ORDER BY "participants"."id" ASC LIMIT $3  [["user_id", 3], ["room_id", 8], ["LIMIT", 1]]
---
  def confirm_participant
    if room.is_private
      is_participant = Participant.where(user_id: user.id, room_id: room.id).first