app/models/room.rb

  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user: user, room_id: single_room.id)
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2024-07-05 13:02:56.243770"], ["updated_at", "2024-07-05 13:02:56.243770"]]
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_3_4"], ["is_private", true], ["created_at", "2024-07-05 16:59:21.817811"], ["updated_at", "2024-07-05 16:59:21.817811"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["room_id", 7], ["created_at", "2024-07-05 16:59:21.874028"], ["updated_at", "2024-07-05 16:59:21.874028"]]

  def participant?(room, user)
    room.participants.where(user: user).exists?
    Participant.where(user_id: user.id, room_id: room.id).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = $1 AND "participants"."user_id" = $2 LIMIT $3  [["room_id", 5], ["user_id", 2], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 LIMIT $3  [["user_id", 2], ["room_id", 5], ["LIMIT", 1]]